CaptainPotatoes/nRF51_EOG_ADS1299_Firmware/main.c
    err_code = dm_init(&init_param);
    APP_ERROR_CHECK(err_code);

    memset(&register_param.sec_param, 0, sizeof(ble_gap_sec_params_t));

    register_param.sec_param.bond         = SEC_PARAM_BOND;
    register_param.sec_param.mitm         = SEC_PARAM_MITM;
    register_param.sec_param.lesc         = SEC_PARAM_LESC;
    register_param.sec_param.keypress     = SEC_PARAM_KEYPRESS;
    register_param.sec_param.io_caps      = SEC_PARAM_IO_CAPABILITIES;
    register_param.sec_param.oob          = SEC_PARAM_OOB;
    register_param.sec_param.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
    register_param.sec_param.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
    register_param.evt_handler            = device_manager_evt_handler;
    register_param.service_type           = DM_PROTOCOL_CNTXT_GATT_SRVR_ID;

    err_code = dm_register(&m_app_handle, &register_param);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance      = true;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    advdata.uuids_complete.p_uuids  = m_adv_uuids;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, NULL, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 
void bsp_event_handler(bsp_event_t event)
{
    uint32_t err_code;
    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            err_code = ble_advertising_restart_without_whitelist();
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        default:
            break;
    }
}*/

/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), 
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}
*/

/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}
#if defined(ADS1299) 
void in_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
		UNUSED_PARAMETER(pin);
		UNUSED_PARAMETER(action);
    m_drdy = true;
}
#endif

#if defined(ADS1299)
static void ads1299_gpio_init(void) {
	#if defined(BOARD_NRF_BREAKOUT)
		nrf_gpio_cfg_output(13);
		nrf_gpio_cfg_output(14);
	#endif
	#if defined(BOARD_FULL_EEG_V1)
		nrf_gpio_cfg_output(3);
		nrf_gpio_cfg_output(2);
	#endif
	#if defined(BOARD_NRF_BREAKOUT) | defined(BOARD_PCA10028)
		nrf_gpio_pin_dir_set(ADS1299_DRDY_PIN, NRF_GPIO_PIN_DIR_INPUT); //sets 'direction' = input/output
		nrf_gpio_pin_dir_set(ADS1299_PWDN_RST_PIN, NRF_GPIO_PIN_DIR_OUTPUT);
	#endif
	#if defined(BOARD_FULL_EEG_V1)
		nrf_gpio_pin_dir_set(ADS1299_PWDN_PIN, NRF_GPIO_PIN_DIR_OUTPUT);
		nrf_gpio_pin_dir_set(ADS1299_RESET_PIN, NRF_GPIO_PIN_DIR_OUTPUT);
	#endif
		uint32_t err_code;
		if(!nrf_drv_gpiote_is_init())
		{
				err_code = nrf_drv_gpiote_init();
		}
		NRF_LOG_PRINTF("nrf_drv_gpiote_init: %d\r\n",err_code);
        APP_ERROR_CHECK(err_code);
		bool is_high_accuracy = true;
		nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_HITOLO(is_high_accuracy);
		in_config.is_watcher = true;
		in_config.pull = NRF_GPIO_PIN_NOPULL;
		err_code = nrf_drv_gpiote_in_init(ADS1299_DRDY_PIN, &in_config, in_pin_handler);
		NRF_LOG_PRINTF(" nrf_drv_gpiote_in_init: %d: \r\n",err_code);
		APP_ERROR_CHECK(err_code);
		nrf_drv_gpiote_in_event_enable(ADS1299_DRDY_PIN, true);
		ads1299_powerdn();
}
#endif /* defined(ADS1299) */

/**@brief Function for application main entry.
 */
int main(void)
{
    NRF_LOG_PRINTF(" BLE ADS1299-EEG - START..\r\n");
    uint32_t err_code;
    bool erase_bonds;
    // Initialize.
    timers_init();
		//buttons_leds_init(&erase_bonds);
    ble_stack_init();
		err_code = nrf_drv_clock_init();
		NRF_LOG_PRINTF("ERRCODE: DRV CLOCK: %d \r\n", err_code);
		APP_ERROR_CHECK(err_code);
    #if defined(ADS1299)
        ads1299_gpio_init();
    #endif
		
    device_manager_init(erase_bonds);
    gap_params_init();
    advertising_init();
    services_init();
    #if defined(BLE_BAS)
        adc_configure();
    #endif
    conn_params_init();
		
    #if defined(ADS1299)
				ads_spi_init();
				nrf_delay_ms(5);
				ads1299_powerdn();
        ads1299_powerup();
        //...
        ads1299_stop_rdatac();
        ads1299_init_regs();
        ads1299_soft_start_conversion();
        ads1299_check_id();
        ads1299_start_rdatac();
        ads1299_standby();
    #endif
    // Start execution.
    application_timers_start();
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
		NRF_LOG_PRINTF(" BLE Advertising Start! %d \r\n",err_code);
		int32_t eeg1;
		int32_t eeg2;
		int32_t eeg3;
		int32_t eeg4;
		#if defined(BOARD_NRF_BREAKOUT)
			nrf_gpio_pin_set(14);
		#endif
		#if defined(BOARD_FULL_EEG_V1) //Board Ready, (GreenLight)
			nrf_gpio_pin_clear(2);
			nrf_gpio_pin_set(3);
		#endif
    // Enter main loop.
    for (;;) {
				if(m_drdy) {
					m_drdy = false;
					//Acquire Data Samples
					get_eeg_voltage_samples(&eeg1, &eeg2, &eeg3, &eeg4);
					//Send 32-bit data samples to be organized into buffer 
					ble_eeg_update(&m_eeg, &eeg1, &eeg2, &eeg3, &eeg4);				
				}
        power_manage();
    }
}

/**
 * @}
 */
